# Определяем переменные
username = "Иван"  # Имя пользователя
title = "Программа"  # Заголовок заметки
content = "Создание программы для заметок."  # Описание заметки
status = "Активна"  # Статус заметки
created_date = "27-12-2024"  # Дата создания заметки
issue_date = "9-1-2025"  # Дата истечения заметки


# Вывод значений переменных
print("Имя пользователя:", username)
print("Заголовок заметки:", title)
print("Описание заметки:", content)
print("Статус заметки:", status)
print("Дата создания заметки:", created_date)
print("Дата истечения заметки:", issue_date)
